БухЭксп/Catalogs/CW_КонтактыеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КонтактыеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Comment>Уволен (не действует)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_КонтактыеЛица/Forms/ФормаВыбораГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	Если (НЕ ЗначениеЗаполнено(Контрагент)) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	// --- 
	_СформироватьДерево();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СформироватьДерево()
	// --- 
	
	//СохранитьВидДерева();
	// --- 
	_СформироватьДерево();
	// --- 
	//ВосстановитьВидДерева();	
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СформироватьДерево()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КонтактыеЛица.Ссылка,
	               |	CW_КонтактыеЛица.Родитель,
	               |	CW_КонтактыеЛица.Наименование,
	               |	0 КАК Уровень,
	               |	CW_КонтактыеЛица.ЭтоГруппа,
	               |	CW_КонтактыеЛица.Должность,
	               |	CW_КонтактыеЛица.Неактивный,
	               |	CW_КонтактыеЛица.Комментарий
	               |ИЗ
	               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
	               |ГДЕ
	               |	CW_КонтактыеЛица.Владелец = &Владелец
	               |	И CW_КонтактыеЛица.ПометкаУдаления = ЛОЖЬ
	               |	И CW_КонтактыеЛица.ЭтоГруппа = ИСТИНА";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("СтрокаСформирована",Новый ОписаниеТипов("Булево"));
	
	УровниГрупп = Новый Соответствие;
	Для каждого Стр Из ТЗ Цикл
		
		Если (Стр.ЭтоГруппа) Тогда
			
			УровниГрупп.Вставить(Стр.Ссылка,_ОпределитьУровеньГруппы(Стр.Ссылка,УровниГрупп));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТЗ.Сортировать("ЭтоГруппа Убыв,Уровень Убыв");
	
	// очищаем дерево
	КонтактныеЛица.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	
	Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
	Нстр.Ссылка = Контрагент;
	Нстр.ЭтоКорень = Истина;
	Нстр.ЭтоГруппа = Истина;
	Нстр.Представление = Строка(Нстр.Ссылка);
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		_СформироватьВеткуДерева(Стр, ТЗ, Нстр);
		
	КонецЦикла; 
	// --- 
	КоличествоПодчиненных = 0;
	Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
		_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
	КонецЦикла; 
	ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")","");
	Нстр.Представление = Строка(Контрагент)+ПредставлениеКоличества;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОпределитьУровеньГруппы(Группа, СоответствиеУровней)
	// --- 
	
	Если (Группа.Родитель.Пустая()) Тогда
		
		УровеньРодителя = 0;
		
	Иначе
		
		УровеньРодителя = СоответствиеУровней.Получить(Группа.Родитель);
		Если (УровеньРодителя = Неопределено) Тогда
			УровеньРодителя = _ОпределитьУровеньГруппы(Группа.Родитель, СоответствиеУровней);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Возврат(1+УровеньРодителя);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьВеткуДерева(СтрокаТЗ, ТЗ, Родитель=Неопределено)
	// --- 
	
	Если (СтрокаТЗ.СтрокаСформирована) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если (Родитель = Неопределено) Тогда
		
		Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		Нстр = Родитель.ПолучитьЭлементы().Добавить();
		
	КонецЕсли; 
	
	Нстр.Ссылка = СтрокаТЗ.Ссылка;
	Нстр.ЭтоГруппа = СтрокаТЗ.ЭтоГруппа;
	СтрокаТЗ.СтрокаСформирована = Истина;
	Если (СтрокаТЗ.ЭтоГруппа) Тогда
		
		Нстр.ИндексКартинки = 0;
		// --- 
		Отбор = Новый Структура("Родитель",Нстр.Ссылка);
		ТаблицаПодчиненных = _сф.к_НайтиСтроки(ТЗ,Отбор);
		Для каждого СтрокаПодчиненного Из ТаблицаПодчиненных Цикл
			_СформироватьВеткуДерева(СтрокаПодчиненного, ТЗ, Нстр);
		КонецЦикла; 
		// --- 
		КоличествоПодчиненных = 0;
		Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
			_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
		КонецЦикла; 
		
		// --- 
		Нстр.КоличествоПодчиненных = КоличествоПодчиненных;
		ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")",""); 
		Нстр.Представление = СтрокаТЗ.Наименование + ПредставлениеКоличества;
		
	Иначе
		
		Нстр.ИндексКартинки = 1;
		Нстр.КоличествоПодчиненных = 1;
		// --- 
		Нстр.Представление = Строка(СтрокаТЗ.Ссылка);
		Нстр.Должность = СтрокаТЗ.Должность;
		Нстр.Неактивный = СтрокаТЗ.Неактивный;
		Нстр.Комментарий = СтрокаТЗ.Комментарий;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура КонтактныеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = КонтактныеЛица.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ОповеститьОВыборе(Стр.Ссылка);
	
КонецПроцедуры
